egme.org
#+TITLE: EmacsGME
#+DESCRIPTION: A variety of elisp functions for implementing a solo role-playing games-master emulator, for playing a full game within an org-file
#+PROPERTY: header-args

* License

Copyright (C) 2021 Category <category@[no_spam]quintendo.uk>

This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; version 2.

This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA. 

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
;;Copyright (C) 2021 Category <category@[no_spam]quintendo.uk>
;;
;;This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; version 2.
;;
;;This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
;;
;;You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA. 
#+END_SRC


* Introduction

The basic idea is to define some functions within Emacs lisp, to facilitate solo role-playing. Then you'll be able to M-x or assign key-binds to quickly roll dice, or get Yes/No oracle results from the GM emulator, fed straight into the document where you are logging your game play. A generic dice roller will be needed (to facilitate any RPG system). As for the GM emulator, I'll need to design a basic system (where outcome likelihood can change), along with a subject/meaning look up table, a way of managing lists of threads/NPCs, and random events popping up.


* Variables

This section will be for defining any variables due for user customization

** Variables for Customize

*** Customize group

The below sets up the group for customize

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defgroup egme nil
  "Variables for customizing the Emacs Games Master Emulator."
  :group 'games)
#+END_SRC


*** Print Ouptut

The below variables define the "braces" around any games-master output. These are set using ~defcustom~ so they can be changed by the user via ~Customize~.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defcustom egme-print-line-start "~~|Games Master|~~~~~~~~~"
  "String printed before games master ouput in non-org buffers."
  :type 'string
  :group 'egme)

(defcustom egme-print-line-end "~~~~~~~~~~~~~~~~~~~~~~~~~"
  "String printed after games master output in non-org buffers."
  :type 'string
  :group 'egme)
#+END_SRC


*** Action/Subject Lists

The below action/subject lists are for random events & detailed questions. The word lists have come from my [[https://quintendo.uk/category/solo-sci-fi-sidekick/][Solo Sci-Fi Sidekick]] cards project.

**** Action

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defcustom egme-action-list '("Abandon"
			      "Abuse"
			      "Adversity"
			      "Agree"
			      "Ambush"
			      "Antagonise"
			      "Arrive"
			      "Assist"
			      "Attach"
			      "Befriend"
			      "Bestow"
			      "Betray"
			      "Block"
			      "Break"
			      "Celebrate"
			      "Change"
			      "Communicate"
			      "Control"
			      "Create"
			      "Cruelty"
			      "Deceive"
			      "Delay"
			      "Desert"
			      "Develop"
			      "Dispute"
			      "Disrupt"
			      "Divide"
			      "Dominate"
			      "Expose"
			      "Failure"
			      "Fight"
			      "Gratify"
			      "Guide"
			      "Harm"
			      "Heal"
			      "Immitate"
			      "Imprison"
			      "Inform"
			      "Inquire"
			      "Inspect"
			      "Intolerance"
			      "Judge"
			      "Kill"
			      "Malice"
			      "Mistrust"
			      "Move"
			      "Neglect"
			      "Open"
			      "Oppose"
			      "Oppress"
			      "Passion"
			      "Persecute"
			      "Praise"
			      "Procrastinate"
			      "Propose"
			      "Punish"
			      "Pursue"
			      "Release"
			      "Return"
			      "Ruin"
			      "Separate"
			      "Spy"
			      "Starting"
			      "Stop"
			      "Take"
			      "Transform"
			      "Travel"
			      "Trick"
			      "Trust"
			      "Violate"
			      "Waste"
			      "Work")
  "List of 'Action' variables used in the random event generator."
  :type '(repeat string)
  :group 'egme)
#+END_SRC


**** Subject

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defcustom egme-subject-list '("A path"
			       "A project"
			       "Adversities"
			       "Advice"
			       "Allies"
			       "Ambush"
			       "Animals"
			       "Art"
			       "Attention"
			       "Balance"
			       "Bureaucracy"
			       "Business"
			       "Competition"
			       "Danger"
			       "Death"
			       "Dispute"
			       "Disruption"
			       "Dreams"
			       "Elements"
			       "Emotions"
			       "Energy"
			       "Environment"
			       "Expectations"
			       "Extravagance"
			       "Failure"
			       "Fame"
			       "Fears"
			       "Friendship"
			       "Goals"
			       "Home"
			       "Hope"
			       "Illness"
			       "Information"
			       "Inside"
			       "Intrigues"
			       "Jealousy"
			       "Joy"
			       "Leadership"
			       "Lies"
			       "Masses"
			       "Messages"
			       "Military"
			       "Nature"
			       "New ideas"
			       "Opposition"
			       "Outside"
			       "Pain"
			       "Peace"
			       "Plans"
			       "Pleasures"
			       "Portals"
			       "Possessions"
			       "Power"
			       "Prison"
			       "Randomness"
			       "Reality"
			       "Riches"
			       "Rumor"
			       "Stalemate"
			       "Status quo"
			       "Success"
			       "Suffering"
			       "Tactics"
			       "Technology"
			       "Travel"
			       "Trials"
			       "Vehicle"
			       "Victory"
			       "Weapons"
			       "Weather"
			       "Wishes"
			       "Wounds")
  "List of 'Subject' variables used in the random event generator."
  :type '(repeat string)
  :group 'egme)
#+END_SRC


** Internal Variables

Variables that are not directly exposed to the user for customization

*** History Lists

The below sets a list to be used for the dice roll function's history.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(setq egme-dice-history (list))
#+END_SRC


*** Probability List

The below list is used for selecting probabilities when asking yes/no questions.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
;; Standard probability list for ido-completing-read
(setq egme-probability-list (list
			     "0  Even odds"
			     "-1  Unlikely"
			     "-2  Very Unlikely"
			     "-3  Extremely Unlikely"
			     "-4  Near Impossible"
			     "+4  Near Certain"
			     "+3  Extremely Likely"
			     "+2  Very Likely"
			     "+1  Likely"))
#+END_SRC


*** Random events

The below intitializes the ~egme-random-counter~ as zero, and set's the possible random events to be generated.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(setq egme-random-counter 0)

(setq egme-random-event-list (list
			      "Remote event"
			      "NPC action"
			      "New NPC appears"
			      "Move towards thread"
			      "Move away from thread"
			      "PC positive"
			      "PC negative"
			      "NPC positive"
			      "NPC negative"
			      "Ambiguous event"))
#+END_SRC


*** NPC List

Create a blank list ~egme-npc-list~, which is populated with the NPC list stored in each game file.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(setq egme-npc-list (list))
#+END_SRC

* Functions

Below are the planned functions, along with some scratch code testing ideas.

** Helper functions

These functions are used internally, to break apart code and help with readablility & reuse

*** DONE Random List Item
CLOSED: [2021-06-29 Tue 15:35]

This function takes a list as input, and returns a random element. This is used several times so broken out into it's own function.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-random-list-item (list-to-pick-from)
  "This function takes a list as an argument, and returns a random element from within that list.

Will return nil if provided list is nil."

  (cond
    (list-to-pick-from (nth (random (length list-to-pick-from)) list-to-pick-from))
    (t nil)))
#+END_SRC


