egme.org
*** DONE Getting Dice Input
CLOSED: [2021-06-16 Wed 16:02]

For dice rolls, we will get user input from the mini-buffer using ~read-string~... Below will ask for a dice roll and set it to the variable ~egme-current-dice~. This function will be non-interactive, so it is only called by other functions, so it can be paired with calculation/printing/etc.


The below regexp is used to check if the variable contains a valid dice input, but if there is no leading number then one is inserted.
[1-9][0-9]?[dD][1-9][0-9]*\\([+-][0-9]+\\)?

A history of dice rolls requested is stored in the variable ~egme-dice-history~, and if no user input at-all is given then the last input is repeated.

The dice input function egme-get-dice:-
#+BEGIN_SRC emacs-lisp :tangle yes :results silent
  (defun egme-get-dice ()
    "Get the required dice-roll from user input on the mini-buffer. Dice rolls to be expected in the usual [number]D[dice-type][modifier] format used by RPGs, for example '2D6' for 2 six-sided dice, or '3d8+2' for 3 eight-sided dice, with 2 added to the result. If the format is given without number (for example 'd100'), then it is assume to be a single dice being rolled.

If no input is given, then it will return the last dice rolled. A full history of rolls is stored in 'egme-dice-history', accessible via the arrow keys when asked for input.

Returns the dice-type, which is also stored in the variable egme-current-dice - returns nil if input can't be parsed into a dice roll."

    (setq egme-current-dice (read-string (format "Enter dice roll (default %s): " (car egme-dice-history))
					 nil
					 'egme-dice-history
					 (car egme-dice-history)))
  
    ;; Add a leading "1" in case user inputs without type (i.e just "D100")
    (when (string-match "^[dD]" egme-current-dice)
      (setq egme-current-dice (concat "1" egme-current-dice)))
  
    ;; Look for string in dice-roll format, return if found
    (when (string-match "[1-9][0-9]?[dD][1-9][0-9]*\\([+-][0-9]+\\)?" egme-current-dice)
      (setq egme-current-dice (match-string 0 egme-current-dice))))
#+END_SRC

The selected dice can later be returned by evaluating it's name.

#+BEGIN_SRC emacs-lisp :tangle no
(egme-get-dice)
#+END_SRC

#+RESULTS:
: 2d6

In the case that a dice-roll cannot be parsed, the output will be ~nil~ so it can be easily read in control functions later.


*** DONE Calculating dice rolls
CLOSED: [2021-06-18 Fri 00:18]

Below is how the dice roll is deconstructed.

First it will get the leading digits to see how many dice are being rolled, then the digits following [dD] for the dice type being used, and lastly the modifier. These numbers are stored in the following variables, in case they are required elsewhere later:-
+ ~egme-current-dice-quantity~
+ ~egme-current-dice-type~
+ ~egme-current-dice-modifier~

Once that info has been extracted, it loops the amount of times in the quantity, generating a random number up to the dice type and summing, then applying the modifier. In the case of a multiple D6 type (ie D66/D666/D6666...) then instead of summing the results it treats each roll as a different digit in the final number.

The final result is stored as ~egme-roll-result~ - this is reset to 0 each time this function is called, in the case of error there will be a zero output rather than the results from a previous roll.

This can be called with a string of the dice roll (or passing the ~egme-get-dice~ function), else it will fallback to the last roll stored in the variable ~egme-current-dice~. User dice roll history will only be affected when using the ~egme-get-dice~ function.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-calculate-dice (&optional dice-roll)
  "Calculates the current dice roll. If called alone, roll the variable egme-current-dice. If argument DICE-ROLL is provided, roll that - it must be in RPG dice notation ('1d20', '3d10+8', '2d6-4', etc). Return the result of the dice roll, and store in the variable egme-roll-result.

Current roll is broken down into the following variable for calculating:-
 +egme-current-dice-quantity
 +egme-current-dice-type
 +egme-current-dice-modifier

This function loops for the quantity of dice, summing up random numbers for the appropriate type, then applying the modifier. In the case of a multiple D6 type (ie D66/D666/D6666...) then instead of summing the results it treats each D6 roll as a different digit in the final result."

  ;; Reset last roll result
  (setq egme-roll-result 0)
  (setq egme-multi-6-temp nil)

  ;; Set egme-current-dice if an option was passed with the function call
  (when dice-roll
    (setq egme-current-dice dice-roll))
  
  ;; Get quantity of dice rolled
  (string-match "^[1-9]+" egme-current-dice)

  (setq egme-current-dice-quantity (string-to-number (match-string 0 egme-current-dice)))

  ;; Get current dice type
  (string-match "[dD][1-9][0-9]*" egme-current-dice)

  (setq egme-current-dice-type (string-to-number (string-trim-left (match-string 0 egme-current-dice) "[dD]")))

  ;; Get modifier (if present, else set to 0)
  (if (string-match "[+-][0-9]+$" egme-current-dice)
      (setq egme-current-dice-modifier (string-to-number (match-string 0 egme-current-dice)))
    (setq egme-current-dice-modifier 0))
  
  ;; Check if dice type is a D66/D666/D6666 etc
  (if (string-match "^66+$" (number-to-string egme-current-dice-type))
      ;; If a multi-6 dice, roll each D6 and combine as string, then repeat for each quantity of rolls
      (dotimes (n egme-current-dice-quantity)
	      (dotimes (n (length (number-to-string egme-current-dice-type)))
          (setq egme-multi-6-temp (concat egme-multi-6-temp (number-to-string (+ 1 (random 6))))))
	      (setq egme-roll-result (string-to-number egme-multi-6-temp)))
    ;; Else calculate dice as usual
    (dotimes (n egme-current-dice-quantity)
      (setq egme-roll-result (+ egme-roll-result (+ 1 (random egme-current-dice-type))))))

  ;; Add the modifier to the result, for the final roll
  (setq egme-roll-result (+ egme-roll-result egme-current-dice-modifier)))
#+END_SRC


Output test:-

#+BEGIN_SRC emacs-lisp :tangle no
;(egme-get-dice)
(egme-calculate-dice "2d6+2")
;egme-current-dice-quantity
;egme-current-dice-type
;egme-current-dice-modifier
#+END_SRC

#+RESULTS:
: 12


*** DONE GM Printed Output
CLOSED: [2021-06-19 Sat 00:39]

This is the core function for output to the user.

Jump to the end of the line, add 2 newlines, add the eGME start line, then the function output (a string taken as an argument), then the eGME end lines. Start and end lines are user configurable via ~customize~, so it can be fomratted however they would like. If the current buffer is an org-mode document, it will instead enclose the output in a quote "GamesMaster" block (which should provide better output if exporting the org document later).

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-print-output (print-string)
  "This function takes a string in as an argument, and prints it's output into the current buffer, between lines highlighting it as games-master output.

For normal text files, the visual braces are stored as the following strings:-

  egme-print-line-start
  egme-print-line-end

If the current buffer is an org-mode document, the output is placed inside a quote block so it can retain the bonuses of export fomatting."

  ;; Move point to "safe" position
  (end-of-line)

  ;; Add additional newline if current line contains is non-blank
  (when (string-match "[:ascii:]" (thing-at-point 'line t))
      (newline))

  (newline)

  ;;; Output the start line
  ;; Check if current buffer is an org-mode file, and output accordingly
  (if (equal (with-current-buffer (current-buffer) major-mode) 'org-mode)
      ;; If an org-file, output into a quote block
      (insert "#+BEGIN_QUOTE GamesMaster")
    ;; Else output the opening brace
    (insert egme-print-line-start))

  (newline)

  ;; Output text generated by egme functions
  (insert print-string)

  (newline)

  ;;;; Output the end line
  ;; Check if current buffer is an org-mode file
  (if (equal (with-current-buffer (current-buffer) major-mode) 'org-mode)
      ;; If an org-file, close the quote block
      (insert "#+END_QUOTE GamesMaster")
    ;; Else output the closing brace brace
    (insert egme-print-line-end))
  
  (newline 2)

  t)
#+END_SRC


