egme.org
*** DONE Random Events
CLOSED: [2021-06-30 Wed 23:11]

The following function will be called from the oracle, and check to see if a random event happened. If so, it will append the details of the random event to ~egme-oracle-output~ to be printed along with the normal outcome of the question.

Every time a random event is checked for, the variable ~egme-random-counter~ is incremented. This is compared to a 1d20 roll - if the roll is lower than the random counter, then a random event has occured. Any text for the random event is added to the ~egme-oracle-output~ string, then the counter is reset. This has the effect that the more questions that are asked, the more likely a random event is to occur.

I may have to change the comparison roll from a D20 - may need some fine tuning to get the frequency right

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
  (defun egme-random-event ()
    "A function for genereating unexpected events.

When an oracle question is asked, this function is called. It keeps a counter in the variable egme-random-counter, which is incremented easch time this is called. Then a single 1d20 is rolled - if the result is lower than the current egme-random-counter value, then a random event is generated. A focus, action and subject are randomly selected from the lists (egme-random-event-list, egme-action-list, and egme-subject-list respectively). If a random event was generated, the counter is reset to 0.

This function then returns the random event text, for the calling function to pass on to for user output."

    ;; Increment random counter
    (setq egme-random-counter (1+ egme-random-counter))

    ;; Clear random event output text
    (setq egme-random-event-output nil)
  
    (cond
      ;; Compare the random counter to a d20 roll
      ((< (egme-calculate-dice "1d20") egme-random-counter)

       ;; Announce the event
       (setq egme-random-event-output "\n------------\nRandom Event!")
      
        ;; Add a type of random event
        (setq egme-random-event-output (concat egme-random-event-output (format "\n      Focus:  %s" (egme-random-list-item egme-random-event-list))))

	;; Add event details
	(setq egme-random-event-output (concat egme-random-event-output (format "\n     Detail:  %s" (egme-random-list-item egme-action-list))(format " / %s" (egme-random-list-item egme-subject-list))))

	;; Reset the random counter
	(setq egme-random-counter 0)

	;; Return text output
	egme-random-event-output)))
#+END_SRC


*** TODO Org-Drawer Management

A pair of functions for opening or closing the NPC/Thread list drawers. Open wil only open it if closed, close will only close an open drawer. This avoids any issues with drawers being manually opened by the user, and avoids the ambiguity of just using ~org-cycle~ by itself.

***** DONE Open a drawer
CLOSED: [2022-06-30 Thu 23:24]

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-open-org-drawer ()
  "This function will open an org-mode drawer on the current line, if it is currently closed.

Open state is determined by checking if current line is a drawer, and if the text at the end of the line is visible. If it is invisible, open the drawer with org-cycle."

  (if (and (org-at-drawer-p) (invisible-p (point-at-eol)))
      (org-cycle)
    (user-error "No closed drawer to open")))
#+END_SRC

***** TODO Close a drawer

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-close-org-drawer ()
  "This function will close an org-mode drawer on the current line, if it is currently open.

Open state is determined by checking if current line is a drawer, and if the text at the end of the line is visible. If it is not invisible, close the drawer with org-cycle."

  (if (and (org-at-drawer-p) (not (invisible-p (point-at-eol))))
      (org-cycle)
    (user-error "No open drawer to close")))
#+END_SRC


** User-facing functions

*** DONE Rolling Dice
CLOSED: [2021-06-19 Sat 00:38]

This function is how the user is expected to interact with the dice roller (typically via a key-bind). It will call the egme-get-dice command, followed by the egme-calculate-dice command, and then output the info in a human-readable format through ~egme-print-output~ - with a smattering of error-checking along the way.

Will also retrun the value of the roll, along with printing the games master output to the current buffer.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-roll-dice ()
  "This function is for a user to generate the results from a dice roll, and output them into the current buffer.

egme-get-dice is called to get user input, egme-calculate dice is used to generate the result, and egme-print-output is used to place this into the current buffer, creating new lines below the point.

This function is interactively callable via M-x, and a prime input option for key-binding."
  ; Let user call via M-x
  (interactive)

  ; Get dice size from user
  (egme-get-dice)

  ; Check dice input was correct
  (if egme-current-dice
    ; If valid then calculate result
    (egme-calculate-dice)
    ; Else drop an error message and exit
    (user-error "Could not parse dice roll"))

  ; Print results
  (egme-print-output (concat (format "Rolled:  %s" egme-current-dice) (format "\nResult:  %s" egme-roll-result)))
  egme-roll-result)
#+END_SRC


