egme.org
*** DONE Yes/No Oracle
CLOSED: [2021-06-30 Wed 23:11]

When first ran, this will ask the usser what question they are asking. This can be ignored by just entering no text

For the oracle, there is a list of different options for the probabilty of a success (likely/even odds/unlikely/etc..) which the user selects interactively. This is seleceted via the function ~ido-completing-read~, using the left & right keys.

For the Oracle, you roll ~1D10~ - on a 6+ the answer is "Yes", on a 5 or less the answer is "No" - this dice roll is modified based on the following probabilities:-
- Near Certain (+4)
- Extremely Likely (+3)
- Very Likely (+2)
- Likely (+1)
- 50/50 (0)
- Unlikely (-1)
- Very Unlikely (-2)
- Extremely Unlikely (-3)
- Near Impossible (-4)

This result can be transformed further. ~1D8~ is rolled alongside this, and on a roll of 1 the result is appened with ", but..", on a roll of 2 it's appended with ", and..." - anything else is ignored. These modifiers are to be interpreted as a partial result ("but" implies some hinderance to the answer) or an extreme result ("and" implies the answer goes beyond what is expected) respectively.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
  (defun egme-y-n-oracle ()
    "The basic oracle function. This will provide Yes/No answers to questions posed to the games master, and outputs the results in the current buffer in the standard games master format.

The user will be asked to input a question - if the end of the current line is parsed as a question, then that will be set as the initial user input. If a quesiton is provided, it will be printed along with the results.
Next, the user will be asked for the likelihood of this result. These options are stored in the list egme-probability-list, and selected via ido-completing-read. Each option is a modifier between -4 and +4, along with a basic description of the probability. This basic description will be printed along with the results.
The answer is generated by rolling 1D10 and applying the chosen modifier, any result of a 6+ will be a 'Yes', anything else a 'No'. A D6 is also rolled, to see if it is an extreme answer - on a 1 it is a minor result (', but...'), and on a 2 it is a major result (', and...').

The function egme-random-event is also called to see if anything unexpected occurs - any change will be added to the variable egme-oracle-output before it gets passed on for user output."
    (interactive)

    ; Reset some variables
    (setq egme-oracle-ouput nil)
    (setq egme-oracle-answer nil)
    (setq egme-current-question nil)
    
    ; Check if the current line contains a question (ends in a question mark, and gets everything from the last ellipses to the end of the line)
    (setq egme-current-line (thing-at-point 'line t))
    (if (string-match "\\.?[0-9A-Za-z ,:;']+\\? *$" egme-current-line)
      ; If that current line is a question, strip any leading ellipses or spaces, then set as pre-filled input when asking for the current question
      (setq egme-current-question (read-string "What is the question? " (replace-regexp-in-string " *$" "" (replace-regexp-in-string "^\\.* *" "" (match-string 0 egme-current-line)))))
      ; Else just ask user for question
      (setq egme-current-question (read-string "What is the question?: ")))
    
    ; Get probability from the user
    (setq egme-current-probability-choice (ido-completing-read "Probability modifier: " egme-probability-list))

    (string-match "[+\-]?[0-9]" egme-current-probability-choice)
    (setq egme-current-probability-modifier (match-string 0 egme-current-probability-choice))
    
    ; Roll dice, apply modifier
    (setq egme-oracle-answer-roll (+ (egme-calculate-dice "1d10") (string-to-number egme-current-probability-modifier)))
    (setq egme-oracle-answer-modifier (egme-calculate-dice "1d6"))

    ; Convert dice rolls into result text - check if modified oracle roll is 6+ ('Yes')
    (if (>= egme-oracle-answer-roll 6)
      ; If greater, then answer yes
      (setq egme-oracle-answer "Yes")
      ; Else answer no
      (setq egme-oracle-answer "No"))
      
    ; Apply answer modifier (if applicable)
    ; Add 'but' if rolled 1, add 'and' if rolled 2
    (cond ((eq egme-oracle-answer-modifier 1) (setq egme-oracle-answer (concat (format "%s" egme-oracle-answer) ", but...")))
          ((eq egme-oracle-answer-modifier 2) (setq egme-oracle-answer (concat (format "%s" egme-oracle-answer) ", and..."))))      


    ;; Prepare output for printing
    ; Check if a question was input...
    (if (> (length egme-current-question) 0)
      ; ..then add quesiton to the output with results
      (setq egme-oracle-output (format "   Question:  %s\n" egme-current-question))
      (setq egme-oracle-output ""))

    ; Get probability text
    (string-match "[A-Za-z][A-Za-z ]*" egme-current-probability-choice)
    (setq egme-probability-text (match-string 0 egme-current-probability-choice))

    ; Add probability and results to output
    (setq egme-oracle-output (concat egme-oracle-output (format "Probability:  %s\n------------" egme-probability-text) (format "\n     Answer:  %s" egme-oracle-answer)))

    ; Check for Random events, add any text to output
    (setq egme-oracle-output (concat egme-oracle-output (egme-random-event)))

    ; Send output string to display to user 
    (egme-print-output egme-oracle-output))
#+END_SRC


** TODO NPC List Handling

The NPC list is stored at the end of the file, under an org header called "EmacsGME Store", and within a drawer called "NPCS" - which would look something like:-

:NPCS:
Alice
Bob
Chris
Dante
Elvira
:END:

The contents of this drawer can be easily parsed into a list when needed, and easily found through searching. The function ~save-excursion~ will be used to return the user where they were in the file.

*** DONE Add NPC
CLOSED: [2022-06-28 Tue 23:49]

This function can either be passed a new character name, or it will ask for user input when a new character is required. It will search the current file backwards for the NPCS drawer, and add the new NPC to the beginning. The drawer will be created at the end of the file if not alread present.

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(defun egme-add-npc (&optional npc-name)
  "This function adds an NPC to the current file.

NPCS are stored at the end of the file, under an :NPCS: drawer. It will search backwards from the end of the file for the drawer, and create it if not found. npc-name is then inserted on at the beginning of the drawer."

  (interactive)

  ;; Ask for NPC name if nothing is passed to the function
  (if npc-name
      t
    (setq npc-name (read-string "New NPC name?")))

  ;; save-excursion so cursor returns to users current position
  (save-excursion
    (progn
      (end-of-buffer)
      
      ;; Search backwards for ":NPCS:" 
      (if (search-backward ":NPCS:" nil t)

	  ;; The drawer has been found, check if npc-name already exists
	  (progn
	    (egme-open-org-drawer)
	    (end-of-line)
	    (newline)
	    (insert npc-name))

	;; The :NPCS: drawer doesn't exist, create it and add the new npc-name
	(insert (concat "\n:NPCS:\n" npc-name "\n:END:\n")))

      ;; Fold the Drawer closed
      (search-backward ":NPCS:" nil t)
      (egme-close-org-drawer)))
  
  ;; Return the added npc-name
  npc-name)
#+END_SRC

*** DONE Parse NPCs to list
CLOSED: [2022-06-30 Thu 01:07]

This function will find the NPC list within the current file, and return it as a list. If an NPC list does not yet exist, it will return ~nil~ and throw a user error.

#+BEGIN_SRC emacs-lisp :tangle yes :resuls silent
(defun egme-parse-npc-list ()
    "This function gets locates the NPC list in the given file, and store all the names in the list egme-npc-list

If the :NPC: drawer cannot be found, then an error message will be created, and the function returns nil. Otherwise, the generated list will be returned (in addtion to being added to egme-npc-list variable)."

  ; Clear any existing data from the stored list variable.
  (setq egme-npc-list (list))

  (save-excursion
    (progn
      (end-of-buffer)

      ;; Find NPC drawer
      (if (search-backward ":NPCS:" nil t)

	  ;; Drawer found, turn it into a list
	  (progn
	    ;; Open drawer before parsing
	    (egme-open-org-drawer)
	    (next-line)

	    ;; Loop until end of drawer found
	    (while (not (string-match "^:END:" (thing-at-point 'line t)))
	      (progn
		;; Add current element, minus final character (trailing newline), then move to next
		(push (substring (thing-at-point 'line t) 0 -1) egme-npc-list)
		(next-line)))

	    ;; Close the drawer again
	    (search-backward ":NPCS" nil t)
	    (egme-close-org-drawer))

	;; No NPC drawer found
	(user-error "No NPC list in current file"))))

  ; Return list contents (or nil if nothing is found)
  egme-npc-list)
#+END_SRC

*** TODO Delete NPC

This function will remove an NPC from the list - the parsed list will be provided to the user, a selection is made, and the new list is written to the file.


** TODO Thread List Handling

Much of this will be a copy & paste from the NPC list department, with minor changes.

