egme.org
* TODO Key map/Key bindings

All default keybindings are set here for the interactive functions. A new map ~egme-map~ is defined and accessed via ~"C-c C-g"~, with all other keybinds under that. 

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
(define-prefix-command 'egme-map)
(define-key mode-specific-map (kbd "C-g") 'egme-map)
(define-key egme-map (kbd "r") 'egme-roll-dice)
(define-key egme-map (kbd "q") 'egme-y-n-oracle)
(define-key egme-map (kbd "n") 'egme-add-npc)
#+END_SRC

